# Using **`MultiIndexes`** ðŸ“š

In [1]:
import pandas as pd

### Creating a sample DataFrame with `MultiIndex`

In [23]:
idx = pd.MultiIndex.from_tuples(
    [(64, "name"), (64, "domain"), (65, "name"), (65, "domain")], names=["urn", "details"])
data = {'data': ["Nirmit Mishra", "ML", "Om Shukla", "MERN"]}

df = pd.DataFrame(data, index=idx)
df

                      data
urn details
64  name     Nirmit Mishra
    domain              ML
65  name         Om Shukla
    domain            MERN

### **Puzzle 1**
Access data using MultiIndex.

In [25]:
# df.loc[64, "name"]
df.loc[65, "domain"].values[0]

'MERN'

### **Puzzle 2**
**Swap** levels in a MultiIndex.

In [29]:
df_swapped = df.swaplevel('urn', 'details')

df_swapped

                      data
details urn
name    64   Nirmit Mishra
domain  64              ML
name    65       Om Shukla
domain  65            MERN

### **Puzzle 3**
Sort a DataFrame by MultiIndex.

In [33]:
df.sort_index(level='urn', ascending=False)

                      data
urn details
65  name         Om Shukla
    domain            MERN
64  name     Nirmit Mishra
    domain              ML

### **Puzzle 4**
`Unstack` a MultiIndex DataFrame.

In [36]:
df_unstacked = df.unstack(level='details')

df_unstacked

          data
details domain           name
urn
64          ML  Nirmit Mishra
65        MERN      Om Shukla

### **Puzzle 5**
`Stack` a DataFrame back into MultiIndex form.

In [38]:
df_stacked = df_unstacked.stack(future_stack=True)

df_stacked.sort_index(level='urn')

                      data
urn details
64  domain              ML
    name     Nirmit Mishra
65  domain            MERN
    name         Om Shukla

### **Puzzle 6**
**Reset** index in a MultiIndex DataFrame.

In [39]:
df_reset = df.reset_index()

df_reset

   urn details           data
0   64    name  Nirmit Mishra
1   64  domain             ML
2   65    name      Om Shukla
3   65  domain           MERN

### **Puzzle 7**
Set a new MultiIndex.

In [41]:
df_new_index = df_reset.set_index(['urn', 'details'])

df_new_index

                      data
urn details
64  name     Nirmit Mishra
    domain              ML
65  name         Om Shukla
    domain            MERN

### **Puzzle 8**
`Aggregate` data over multiple levels.

In [42]:
df_agg = df.groupby(level='details').sum()

df_agg

                           data
details
domain                   MLMERN
name     Nirmit MishraOm Shukla

In [ ]:
# Feel free to code ...